In [ ]:
import numpy as np

alumnos_clase = ['Ramon', 'Jose', 'Alberto', 'Julia',
                 'Cristian', 'Cristina Martinez', 'Javier Melo', 'Mario',
                 'Javier Aparicio', 'Arturo', 'Marta', 'Sonia']

def sorteo_par(alumnos):
    len_parejas = len(alumnos)
    couples = []
    
    for i in range(int(len_parejas/2)):
        uno = np.random.choice(alumnos, 1)[0]
        alumnos.remove(uno)

        dos = np.random.choice(alumnos, 1)[0]
        alumnos.remove(dos)

        couples.append((uno, dos))
        
    return couples, alumnos


couples, resto = sorteo_par(alumnos_clase)

if len(resto) > 0:
    pareja_elegida = np.random.randint(0, len(couples))
    couples[pareja_elegida] = couples[pareja_elegida] + (resto[0],)

    
print("PAREJAS DE ALUMNOS")
couples

In [33]:
alumnos_clase = ['Ramon', 'Jose', 'Alberto', 'Julia',
                 'Cristian', 'Cristina Martinez', 'Javier Melo', 'Mario',
                 'Javier Aparicio', 'Arturo', 'Marta', 'Sonia', 'Cristina Martiñan']
import pandas as pd

df_clase = pd.DataFrame(alumnos_clase, columns=['Clase'])
df_clase.sample(frac = 1).reset_index(drop=True)

                Clase
0               Julia
1               Mario
2             Alberto
3   Cristina Martinez
4                Jose
5              Arturo
6               Ramon
7         Javier Melo
8               Sonia
9            Cristian
10  Cristina Martiñan
11    Javier Aparicio
12              Marta